Revit 2027 API
BuiltInFailures.SketchFailures.BeamDirectionNotSpecified Property
 Beam direction not specified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BeamDirectionNotSpecified { get; }
Public Shared ReadOnly Property BeamDirectionNotSpecified As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BeamDirectionNotSpecified {
	FailureDefinitionId^ get ();
}
static member BeamDirectionNotSpecified : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace